</s> 56057
583 16416
597 13907
764 9704
820 8197
859 6501
1985 4931
564 4472
782 4096
756 3890
1428 3345
3559 2830
3237 2757
985 2575
561 2532
792 2405
684 2400
734 2111
2564 1912
3227 1780
1587 1741
878 1694
1595 1618
784 1579
809 1577
571 1536
706 1390
679 1371
1859 1334
858 1300
1462 1244
1927 1229
643 1216
1919 1149
702 1148
786 1138
743 1086
3399 1068
620 1055
3187 1054
3904 1019
4451 997
824 993
5525 954
3464 944
664 924
3556 913
3606 897
2314 882
573 853
1996 851
567 848
4180 836
690 836
1202 813
2042 794
630 791
6760 785
2886 759
2072 744
1101 712
984 710
2939 673
1529 669
3459 662
4165 657
3179 656
1120 632
3313 621
3740 614
2057 612
2151 608
3097 597
916 597
2611 595
759 593
3337 584
2206 581
3569 577
657 566
3855 566
898 565
8012 529
815 517
3168 517
3027 516
1874 510
3738 494
2576 491
3112 487
578 486
2877 486
3975 486
3036 481
1256 480
617 477
6356 476
791 475
4347 473
988 464
3066 443
4000 433
1143 427
1876 415
7244 413
1157 412
4697 410
587 407
546 403
4789 398
3087 394
5536 392
5229 388
2740 382
1375 380
1235 374
2892 370
1309 365
6812 358
2945 351
5620 349
6289 348
7441 347
1854 340
895 339
6958 337
5226 330
5482 330
4050 323
3053 322
909 321
757 320
6365 319
3841 317
864 316
4951 311
4335 310
6879 309
3261 308
2738 308
3986 307
662 306
3885 306
3146 306
5552 303
7132 300
3219 298
659 292
4464 292
1419 290
9944 289
7784 289
618 287
539 285
9786 285
6140 285
691 281
4897 279
4408 273
3915 270
6190 268
4685 265
2534 264
7408 256
1969 255
5362 254
6566 254
580 246
6180 245
4912 244
2644 242
1133 241
2652 240
3305 240
3241 238
3433 236
1478 235
3909 235
4076 235
718 232
7154 230
1390 228
2083 228
7863 226
4570 225
701 225
2349 225
7954 225
3932 223
4331 223
1925 222
7041 222
5172 220
3326 219
830 218
1856 217
9272 216
7948 214
3290 214
5129 212
1980 212
3126 212
1451 209
553 208
5122 206
3589 206
4695 205
9041 204
977 204
6975 203
832 202
10047 202
843 202
800 201
870 197
1475 196
6474 196
631 195
5076 192
1065 191
1964 191
4271 189
4806 189
3863 188
3865 187
1304 186
8742 183
7317 182
3650 182
7705 182
3550 181
3446 180
7386 180
839 180
7206 178
2863 177
7227 177
893 177
6215 176
3777 176
3257 173
2902 172
4156 172
2846 171
785 171
5103 171
10322 170
5046 170
4420 170
875 168
5660 167
8148 166
4386 166
10400 165
6936 160
2126 160
823 159
4881 159
4085 159
4046 158
10499 157
557 157
7120 157
681 156
3690 156
5381 156
622 155
700 154
3584 152
8256 151
1445 150
7258 149
2793 147
4494 146
8295 145
790 145
5192 145
9438 144
3859 144
7366 144
1553 142
4706 142
601 141
6863 141
3470 140
2935 139
707 139
3727 139
8455 138
2713 138
4345 138
5527 137
9969 136
8496 136
1184 135
3295 135
853 135
9775 134
5184 132
3070 132
4364 131
4182 131
547 130
4510 130
2854 129
993 128
1575 128
554 128
5953 128
7657 128
5132 128
4025 128
4012 128
829 127
8587 127
716 127
3391 125
5097 125
2160 124
3086 124
6363 123
3924 123
5663 123
8545 122
4325 122
584 120
2931 120
8960 120
3922 119
4078 118
2993 118
4993 118
2263 118
5947 118
8224 117
5518 117
4098 117
8722 116
1182 116
10680 116
687 115
8161 115
3051 115
1580 115
7094 115
6861 114
733 113
5208 113
7602 113
4666 111
2030 111
10425 110
3410 110
10804 110
3068 110
6785 109
3110 108
4236 108
5762 108
4393 107
2201 107
7046 107
8869 106
6426 105
5145 104
3299 104
4610 104
8300 104
4586 104
2958 103
627 102
6448 102
5142 102
2260 102
6753 101
2100 100
7891 100
3205 100
2135 100
5071 100
7554 99
9348 99
4995 99
592 98
9330 98
6779 98
7471 98
4262 98
7523 98
7220 97
10256 96
6280 95
8651 94
12282 94
2495 93
1422 93
2226 93
9278 93
1170 92
648 92
6751 92
4065 92
750 91
10357 91
2997 91
1383 91
7419 90
6131 90
3709 90
10906 89
3045 89
6973 89
8172 89
1563 88
6766 88
838 88
3397 88
3944 88
7201 88
3407 88
6682 88
3193 87
2204 86
7412 85
2875 84
3307 84
4553 84
645 84
10417 83
1971 83
8776 83
7700 83
972 83
3099 82
7122 82
1339 82
5186 82
4367 81
6472 81
6881 81
3148 81
5723 80
6631 80
8026 79
673 79
8822 79
1229 79
7933 79
635 79
3988 79
4221 78
6815 78
723 78
6236 78
2286 78
7499 78
7263 77
794 77
4576 77
4371 77
3579 77
7887 76
8871 76
6187 76
5674 76
5448 75
3174 75
7751 75
4160 75
9154 75
2664 75
1546 75
7136 75
566 74
755 74
2802 74
2860 74
3047 74
2171 73
2914 73
641 73
2516 73
6135 73
8928 72
2021 72
2975 71
8368 71
5115 71
6522 71
6387 70
9742 70
6489 70
5442 69
null 69
5737 69
7980 68
5585 68
5935 68
4118 68
544 66
4023 66
6867 66
4671 66
8691 65
4031 65
543 65
7501 65
8897 65
5026 65
663 65
4908 65
2307 65
4688 64
3158 64
7971 64
8482 64
2532 64
8009 64
8711 64
7218 63
8057 63
8726 62
4193 62
3524 62
6857 62
7497 62
8859 61
5406 61
3229 60
7899 60
4563 60
4847 60
2999 60
6294 60
3632 60
705 60
4967 60
728 59
5105 59
4129 59
7059 59
1606 59
6406 58
2045 58
1508 58
5685 58
1868 58
4135 58
8744 58
3441 57
11219 57
6167 57
10432 57
6420 57
677 57
4199 57
3343 57
7626 57
4466 57
563 57
6058 57
5050 57
1279 56
3439 56
6039 56
2541 56
4417 56
1181 55
2599 55
1521 55
579 55
7188 55
6661 55
3965 55
3489 55
3277 55
6680 55
6021 55
4804 55
3773 55
4275 55
2156 54
660 54
1962 54
8753 54
8186 54
6688 54
7990 54
4273 54
10684 54
3019 53
4232 53
1977 53
8101 53
754 53
6276 53
8238 53
6962 52
735 52
803 52
1286 52
5764 52
4681 52
10031 51
7677 51
6676 51
4589 51
4557 51
1307 51
2682 51
4423 51
8241 51
5800 51
831 50
682 50
5480 50
7152 50
1604 49
9556 49
6372 49
10269 49
7089 49
6378 49
4773 49
4714 49
1485 49
2327 49
632 49
9747 49
3676 48
646 48
2596 48
5343 48
1343 48
2005 48
7998 48
10284 48
3663 48
5221 48
3191 48
2539 48
7923 48
6528 48
4625 47
560 47
674 47
1146 47
4170 47
6477 47
3143 47
2694 46
7457 46
11467 46
4172 46
9079 46
5681 46
9340 46
1385 46
7930 45
2274 45
11786 45
1032 45
3684 45
7035 45
8204 45
9680 45
11022 45
7461 45
3734 45
11393 45
7613 44
1444 44
6911 44
8885 44
4095 44
3114 44
680 43
6306 43
822 43
7043 43
10073 43
2867 43
6438 43
729 43
5798 43
4766 43
770 42
8257 42
9462 42
542 42
9427 42
7880 42
2856 42
9587 42
2756 42
6455 42
8001 41
7734 41
4941 41
6049 41
12528 41
6546 41
7822 41
7301 41
4131 41
640 41
9647 41
6410 41
7566 41
6413 41
1162 41
3736 41
868 41
5743 41
2500 41
2585 41
7760 40
555 40
7828 40
841 40
2956 40
7295 40
8031 40
1220 40
7609 40
4522 40
2132 40
9942 39
7809 39
804 39
4103 39
3003 39
7765 39
13316 39
8342 39
4963 39
6227 39
6430 39
10820 39
1591 39
6757 39
3890 39
4240 39
3686 38
13475 38
10766 38
1192 38
6446 38
3141 38
11269 38
8824 38
7712 38
7878 38
4561 38
8360 38
6296 38
8695 38
4910 38
6805 37
6846 37
4901 37
2224 37
6124 37
6494 37
3930 37
7211 37
6722 37
7770 37
3780 37
7224 37
2742 36
2078 36
724 36
4203 36
6588 36
3963 36
7889 36
11615 36
642 36
5138 36
10894 36
4158 36
5669 36
5715 36
5591 36
9623 36
2182 36
5700 36
813 36
10928 35
2949 35
5758 35
5217 35
10992 35
11055 35
6062 35
3280 35
8475 35
8755 35
2312 35
3602 35
7291 35
585 35
9196 35
12328 35
5471 35
2922 35
658 35
6370 35
6575 35
6249 35
1457 34
13154 34
4352 34
12530 34
10176 34
8528 34
12125 34
9502 34
7481 34
9865 34
7105 34
678 34
2928 34
8504 33
8956 33
6043 33
10045 33
5607 33
1165 33
4930 33
2977 33
7335 33
2852 33
5378 33
4133 33
6068 33
6479 33
7328 33
6113 32
9890 32
11251 32
7910 32
11083 32
9075 32
5027 32
2704 32
1265 32
6121 32
819 32
656 32
7552 32
1616 31
10313 31
6627 31
7293 31
10559 31
1059 31
4038 31
9824 31
5510 31
2221 31
11265 31
6510 31
738 31
9011 31
10136 31
2401 31
6745 31
8117 31
2685 31
3116 31
7287 31
6768 31
6733 30
3554 30
8063 30
10436 30
1414 30
6533 30
7719 30
8683 30
8305 30
8662 30
6283 30
3957 30
11067 30
3061 30
9442 30
8042 30
8084 30
7988 30
7146 30
3615 30
5711 29
3078 29
665 29
1549 29
8371 29
7939 29
10528 29
1262 29
9795 29
8853 29
7192 29
4738 29
6741 29
7925 29
12226 28
3221 28
1621 28
2770 28
2618 28
12705 28
6452 28
8150 28
5021 28
2108 28
9297 28
4162 28
5330 27
2954 27
7996 27
1216 27
4932 27
6017 27
7160 27
9240 27
2546 27
880 27
5210 27
8486 27
2361 27
3769 27
4845 27
7976 27
6889 27
569 27
8355 27
4284 27
3519 27
6217 27
5275 27
10317 26
7016 26
6907 26
11352 26
2276 26
7337 26
7414 26
3539 26
4267 26
2508 26
6969 26
6716 26
2166 26
9266 26
7479 26
2124 26
8086 26
8367 26
7596 26
2398 26
2581 26
5136 26
6513 26
10460 25
9007 25
6460 25
7063 25
3164 25
8462 25
4410 25
9055 25
7341 25
6946 25
1534 25
10407 25
8581 25
7685 25
3803 25
7830 25
11091 25
9692 25
9832 24
793 24
10226 24
4406 24
9211 24
7333 24
6384 24
1584 24
7941 24
4965 24
8693 24
5508 24
908 24
11608 24
3136 24
6875 24
8127 24
3293 24
9599 24
7600 24
7689 24
5665 24
12375 24
7568 24
576 24
7785 23
10578 23
742 23
12731 23
7473 23
10351 23
7421 23
3721 23
7805 23
12678 23
10311 23
5031 23
6064 23
7190 23
8019 23
6783 23
1453 23
4798 23
6090 23
10188 23
8279 23
3793 23
6859 22
2235 22
10763 22
3825 22
7985 22
6713 22
11653 22
7216 22
3199 22
6913 22
3642 22
6270 22
3571 22
5374 22
3015 22
5645 22
3783 22
7835 22
7036 22
802 22
6028 22
2772 22
6987 22
6137 22
6849 22
624 21
872 21
5339 21
8548 21
2985 21
9023 21
1148 21
11283 21
4893 21
12116 21
2519 21
3124 21
5307 21
849 21
905 21
638 21
7839 21
6530 21
8014 21
634 21
8585 21
6397 21
1294 21
2842 21
2076 21
7376 21
7832 21
6251 21
6928 21
4040 20
11669 20
719 20
2579 20
8359 20
7467 20
556 20
1599 20
5251 20
2241 20
9576 20
11201 20
12490 20
8232 20
7723 20
7087 20
3671 20
8905 20
12651 20
2376 20
7746 20
1526 20
2476 20
2329 20
7148 20
8130 20
11768 20
6119 19
6873 19
3171 19
3328 19
7169 19
1540 19
3395 19
12586 19
10548 19
5058 19
13654 19
8069 19
4572 19
7269 19
11118 19
7725 19
6247 19
4056 19
626 19
689 19
7521 19
8907 19
7171 19
11175 19
3747 19
6623 19
9667 19
4052 19
4339 19
4189 19
5080 19
9696 19
7792 19
5633 18
5257 18
6491 18
7240 18
7158 18
13397 18
5780 18
1098 18
5939 18
6583 18
8607 18
12442 18
9084 18
9176 18
1239 18
2745 18
6700 18
10768 18
1412 18
8281 18
7868 18
8709 18
4005 18
1609 18
9291 18
3249 18
9379 18
5491 18
2385 18
7905 18
7669 18
9764 18
10229 18
13327 18
846 17
7507 17
12668 17
9433 17
5505 17
5649 17
6000 17
11905 17
5579 17
3485 17
8195 17
6211 17
9687 17
3658 17
10183 17
10550 17
6106 17
6418 17
6376 17
4082 17
10970 17
1847 17
4825 17
7865 17
8491 17
8836 17
2715 17
11602 17
887 17
11186 17
9063 17
7960 17
5641 17
6428 16
11634 16
6731 16
9842 16
1960 16
1430 16
551 16
4269 16
6256 16
666 16
12052 16
11446 16
5489 16
2522 16
3725 16
596 16
736 16
8500 16
3849 16
7591 16
6287 16
8045 16
10315 16
6466 16
7426 16
5476 16
3162 16
10026 16
7246 16
2961 16
676 16
8340 16
10823 16
10861 16
3362 16
3775 16
3911 16
10224 15
5639 15
3128 15
13060 15
11062 15
5637 15
1851 15
13296 15
8309 15
4002 15
8973 15
12596 15
8890 15
4635 15
6837 15
2117 15
7475 15
8688 15
6368 15
12956 15
8006 15
795 15
6561 15
7695 15
6408 15
7843 15
2942 15
2937 15
3072 15
8449 15
8335 15
1080 15
1466 15
4673 15
7604 15
4301 15
4526 15
6670 15
6036 15
11320 15
2347 15
10772 15
10526 15
7819 15
3717 15
1069 14
11047 14
10181 14
789 14
12896 14
13038 14
6829 14
4020 14
2067 14
6655 14
9125 14
8234 14
1561 14
6825 14
4727 14
10847 14
10428 14
6101 14
9169 14
6764 14
1368 14
5496 14
2512 14
763 14
4895 14
10252 14
11156 14
9469 14
799 14
3887 14
8951 14
7203 14
12980 14
2283 14
1436 14
12799 14
7126 14
6772 13
8700 13
9817 13
12700 13
4151 13
10344 13
2331 13
7110 13
7928 13
8676 13
12356 13
11388 13
10843 13
11563 13
8037 13
9260 13
6422 13
8728 13
11016 13
4926 13
7907 13
5671 13
5861 13
998 13
2199 13
11705 13
8747 13
540 13
6520 13
13632 13
2074 13
8616 13
5356 13
7388 13
6272 13
12576 13
2747 13
5651 13
2760 13
8105 13
7312 13
7485 13
12663 13
8178 13
5709 13
3587 13
6515 13
8382 13
6192 13
10914 13
5810 13
8656 13
4007 12
897 12
8088 12
11354 12
2655 12
13684 12
2325 12
9254 12
12371 12
11221 12
3476 12
5676 12
4853 12
2096 12
7096 12
6030 12
3831 12
6142 12
2833 12
9216 12
6544 12
1252 12
10037 12
12589 12
772 12
8971 12
6075 12
4781 12
7229 12
6581 12
6300 12
3449 12
9242 12
9610 12
12157 12
5704 12
8047 12
748 12
6601 12
570 12
12392 12
5101 12
4429 12
5512 12
4333 12
5426 12
7982 12
7549 12
10598 12
13588 12
12444 12
9791 12
6663 12
10120 12
10468 11
10108 11
12999 11
8113 11
7351 11
10838 11
13226 11
768 11
867 11
2186 11
10024 11
3181 11
1966 11
9585 11
2754 11
9445 11
8024 11
11404 11
10231 11
6034 11
3811 11
7562 11
9960 11
7066 11
3285 11
7579 11
7707 11
9275 11
10007 11
5354 11
8985 11
8207 11
10663 11
6777 11
3682 11
9987 11
8649 11
2408 11
6196 11
5085 11
2608 11
7447 11
8212 11
7222 11
11152 11
599 11
1496 11
6788 11
6678 11
7299 11
847 11
4062 11
10419 11
6840 11
9826 11
3074 11
6261 11
8857 11
13187 11
6950 11
8346 11
8803 11
3264 11
6981 11
6781 11
7238 11
10778 11
3610 11
9811 10
4028 10
688 10
885 10
13268 10
6738 10
11042 10
8073 10
6483 10
11656 10
1271 10
6424 10
11239 10
8621 10
8557 10
10775 10
1571 10
10374 10
3692 10
9165 10
9835 10
2366 10
10170 10
2188 10
2732 10
4147 10
11130 10
2646 10
6116 10
2702 10
10368 10
604 10
8543 10
4721 10
7795 10
8422 10
11277 10
1130 10
7254 10
8484 10
11275 10
8293 10
4499 10
6607 10
906 10
2865 10
2667 10
6526 10
2438 10
7445 10
4337 10
2557 10
5561 10
3217 10
2897 10
8734 10
5831 10
4922 10
7459 10
9326 10
7717 10
6097 10
7309 10
5787 10
10392 9
11870 9
13035 9
708 9
13077 9
4810 9
5438 9
574 9
9678 9
605 9
11214 9
3454 9
6524 9
9711 9
14151 9
10079 9
7798 9
9028 9
11408 9
3223 9
8522 9
6690 9
8531 9
3723 9
10643 9
636 9
10947 9
3787 9
796 9
8845 9
8275 9
6005 9
10326 9
11600 9
8705 9
8611 9
8124 9
3609 9
7936 9
9352 9
8827 9
7589 9
9429 9
7477 9
667 9
3828 9
2613 9
1137 9
12997 9
7364 9
5093 9
6198 9
3544 9
5436 9
6586 9
1007 9
6916 9
6579 9
4044 9
7362 9
12776 9
11454 9
10122 9
8338 9
9991 9
5023 9
10134 9
11230 9
8277 9
4058 9
6202 9
3031 9
6243 9
7780 9
11132 9
5474 9
7424 9
5248 9
12878 9
8135 9
9729 8
11255 8
11925 8
9813 8
12437 8
7855 8
10094 8
7487 8
8894 8
7732 8
4255 8
3001 8
861 8
9582 8
7968 8
3225 8
11140 8
9466 8
6557 8
5212 8
10950 8
8922 8
3795 8
978 8
2555 8
787 8
8614 8
4787 8
5658 8
9514 8
10295 8
9510 8
9073 8
6108 8
9206 8
7428 8
8730 8
1316 8
6819 8
7965 8
6801 8
6268 8
996 8
6129 8
797 8
4509 8
12309 8
4662 8
8364 8
2112 8
7702 8
3120 8
4818 8
7667 8
1096 8
6571 8
8243 8
8410 8
9948 8
7374 8
8040 8
4886 8
6842 8
1214 8
9449 8
5812 8
11113 8
2154 8
5635 7
8103 7
10402 7
1944 7
10289 7
7430 7
3495 7
2227 7
11911 7
10890 7
3599 7
11049 7
6518 7
11713 7
1077 7
9191 7
10719 7
11591 7
3752 7
11448 7
7776 7
8814 7
13427 7
13381 7
11743 7
11228 7
12063 7
7758 7
13664 7
7000 7
8377 7
2520 7
11390 7
6351 7
669 7
3025 7
697 7
9338 7
9519 7
11756 7
7183 7
9767 7
8402 7
5290 7
9201 7
5350 7
8536 7
4438 7
7721 7
4054 7
2982 7
1517 7
8751 7
6708 7
3805 7
2559 7
3356 7
5198 7
7598 7
7710 7
2630 7
6666 7
3816 7
4758 7
12466 7
5164 7
3103 7
13559 7
765 7
1362 7
3482 7
2092 7
11348 7
4899 7
10339 7
8351 7
5735 7
7331 7
4906 7
4877 7
13292 7
14089 7
13298 7
10632 7
6971 7
10806 7
5667 7
13387 7
10067 7
6171 7
10937 7
13373 7
13019 7
13404 7
8629 7
11279 7
12889 7
9727 6
10376 6
10355 6
2453 6
2429 6
13497 6
2561 6
11395 6
11853 6
10022 6
12469 6
6729 6
13102 6
886 6
9373 6
7011 6
11193 6
918 6
11501 6
9676 6
2899 6
577 6
6336 6
9104 6
6153 6
12193 6
8193 6
9918 6
1473 6
2550 6
7276 6
13446 6
13763 6
769 6
694 6
550 6
11658 6
12593 6
3331 6
2425 6
7946 6
3333 6
9324 6
11909 6
4879 6
5678 6
6535 6
2403 6
7870 6
9803 6
9895 6
7817 6
6449 6
8812 6
8619 6
5791 6
8675 6
8099 6
9967 6
2831 6
8003 6
4501 6
8250 6
6298 6
8420 6
13189 6
1248 6
814 6
2472 6
5730 6
11425 6
7402 6
1455 6
1008 6
1551 6
4060 6
6147 6
13527 6
2459 6
8563 6
6603 6
5955 6
9617 6
5459 6
5288 6
2441 6
4871 6
5067 6
891 6
780 6
11611 6
4230 6
12155 6
6720 6
11810 6
1320 6
2353 6
2380 6
2725 6
13139 6
11882 6
8625 6
5816 6
9907 6
13117 6
8170 6
7974 6
11495 6
8406 6
7672 6
6648 6
6145 6
12354 6
10552 6
13530 6
12133 6
12841 6
3389 6
7214 6
8393 6
11849 6
10053 6
13130 6
12099 6
8034 6
9568 6
8312 6
8051 6
11521 6
7289 6
6292 6
10489 6
7242 6
5336 6
4603 6
12088 6
10237 6
13423 6
8782 6
8075 6
9828 6
9784 6
8067 6
10458 6
9067 6
4882 6
11559 6
12479 5
13960 5
9922 5
11410 5
2040 5
9244 5
10522 5
10013 5
12197 5
12056 5
11715 5
9202 5
11659 5
12526 5
12568 5
8268 5
7801 5
9744 5
5462 5
13272 5
11366 5
5273 5
11691 5
13976 5
11460 5
2583 5
12171 5
12718 5
10873 5
2319 5
711 5
8583 5
4762 5
4675 5
9334 5
5796 5
5581 5
11166 5
7173 5
6638 5
8817 5
5612 5
9230 5
5271 5
1541 5
11374 5
12319 5
2502 5
12740 5
11766 5
9532 5
3630 5
7049 5
11816 5
9505 5
590 5
6724 5
8426 5
5428 5
2506 5
6711 5
8254 5
6672 5
8228 5
615 5
8139 5
6457 5
9281 5
2570 5
12068 5
842 5
2537 5
5446 5
11541 5
3339 5
3754 5
6718 5
3542 5
901 5
1311 5
5546 5
6213 5
6092 5
6278 5
5202 5
2615 5
11034 5
11259 5
6727 5
4391 5
11726 5
5575 5
11835 5
10494 5
11288 5
3732 5
3160 5
13113 5
11470 5
6087 5
12223 5
10512 5
7410 5
9173 5
7437 5
13544 5
2758 5
7606 5
12054 5
4598 5
4800 5
6458 5
8191 5
6941 5
7384 5
2924 5
11076 5
737 5
11290 5
11605 5
12785 5
11644 5
7573 5
4258 5
9977 5
8848 5
5124 5
8467 5
10749 5
11638 5
3239 5
13969 5
13246 5
9558 5
8901 5
8861 5
7196 5
6239 5
5434 5
9137 5
12991 5
5315 5
11579 5
7140 5
12339 5
11678 5
5117 5
