</s> 4425
583 3316
764 1584
597 1441
1985 1272
859 955
820 824
756 792
782 739
3237 556
3559 454
1595 434
564 432
1428 422
985 379
3227 366
878 363
734 343
679 340
1927 328
684 327
792 322
2564 305
809 294
567 279
1859 272
571 264
858 257
1996 231
706 209
4451 199
786 194
1120 193
546 189
561 183
1587 181
1202 178
3168 177
984 166
784 165
2611 161
815 159
3179 152
2057 146
2939 145
643 143
7244 143
3464 141
4180 138
664 135
3459 133
690 132
3738 127
3904 122
5525 121
6356 120
3036 119
988 117
1309 111
5076 108
1919 107
743 106
1101 105
539 104
2072 103
7041 100
2576 98
3433 98
4789 97
2206 97
657 96
1874 96
3399 95
3841 95
824 94
1256 94
864 94
2740 93
1157 90
6760 88
1375 86
6812 86
618 84
620 83
3606 83
3187 81
9272 81
3569 81
1235 80
2652 75
800 73
895 73
4347 72
5620 72
3337 70
2534 68
7408 67
791 67
10400 67
1143 67
3855 67
662 66
2738 66
785 66
759 66
5226 65
691 63
829 62
6289 62
2892 61
1462 61
630 60
6180 60
2042 60
2644 59
547 59
916 59
557 59
617 59
898 57
3550 56
2151 56
8161 56
3865 56
7471 55
733 55
875 54
3975 54
3446 53
6936 52
601 52
8742 52
5172 51
3932 51
645 50
584 50
2126 50
2877 50
592 50
659 49
4271 49
573 49
2945 49
757 48
1925 48
1563 48
7954 47
755 46
1876 46
9786 45
2902 45
3909 45
9969 44
909 44
5362 43
1529 43
543 42
1478 42
3241 42
3112 42
870 42
8295 41
4912 41
1553 40
3045 40
578 40
7948 40
4078 39
7227 39
1451 39
8722 38
10499 38
9944 38
7705 38
4408 38
3313 37
832 37
8651 36
646 36
1182 36
2495 36
6140 36
4165 36
6815 35
5552 35
3690 35
702 35
4000 34
2349 34
8256 34
4993 33
4951 33
10322 32
7887 32
3740 32
2156 32
5208 32
1856 32
2160 31
4697 31
1854 31
839 31
5103 31
542 30
673 30
2314 30
8545 30
2232 30
4050 30
648 29
544 29
1575 29
794 29
2993 29
3205 29
3087 29
7206 29
7602 29
3257 28
972 28
2263 28
4156 28
5122 28
10804 28
8224 28
3556 28
4193 27
4221 27
587 27
8496 27
7457 27
8116 27
5071 26
3261 26
2135 26
5953 26
8148 26
6167 26
4393 26
677 26
3584 26
5527 25
566 25
1521 25
3326 25
9438 25
5406 25
838 25
2886 25
660 25
631 25
2875 24
4706 24
8026 24
5585 24
7132 24
3343 24
701 24
7317 24
687 24
3086 24
1133 24
718 24
3099 24
7120 24
3944 24
4160 24
2863 23
10047 23
728 23
804 23
3295 23
1445 23
3777 23
4085 23
553 23
8869 22
5229 22
4576 22
7891 22
5192 22
4666 22
2083 22
681 21
3299 21
10680 21
4570 21
6489 21
3027 21
1065 21
1184 20
8776 20
563 20
3305 20
6494 20
10906 20
4510 20
8101 20
5046 20
6190 20
9348 20
7933 19
3097 19
8859 19
1604 19
3986 19
2078 19
8504 19
580 19
9775 19
2100 19
6973 19
1307 19
1279 19
3410 19
4335 19
2793 19
2596 19
2599 18
3676 18
1390 18
2846 18
6879 18
6306 18
723 18
7930 18
3053 18
9742 18
1964 18
554 18
7366 18
4232 18
2182 18
977 18
707 17
4327 17
7293 17
6365 17
5448 17
8587 17
1444 16
2546 16
4847 16
7263 16
7760 16
6187 16
680 16
1475 16
8368 16
4688 16
3066 16
716 16
8204 16
2975 16
642 16
5660 16
4262 16
4331 16
738 16
8241 16
579 15
6975 15
841 15
4031 15
5343 15
823 15
3126 15
11352 15
6566 15
7822 15
8371 15
3734 15
4199 15
2286 15
3290 15
10417 14
8905 14
7677 14
5947 14
3441 14
2954 14
11219 14
2224 14
2030 14
9041 14
6017 14
3632 14
770 14
5115 14
7566 14
627 14
790 14
3070 14
7414 14
7501 14
4023 14
1580 14
3391 14
5105 14
7386 14
12282 14
555 14
8573 14
6124 14
658 14
4714 13
8683 13
5442 13
1339 13
4901 13
2226 13
6448 13
2770 13
7863 13
12586 13
4364 13
6215 13
8822 13
4557 13
7461 13
1146 13
3146 13
6430 13
11067 13
8257 13
2999 13
4423 12
1170 12
3229 12
7441 12
742 12
7473 12
2802 12
6363 12
8726 12
11251 12
9433 12
1080 12
7301 12
4131 12
3650 12
3539 12
7412 12
9196 12
4610 12
5681 12
2108 12
4881 12
5138 12
3068 12
3736 12
893 12
9176 11
4082 11
13475 11
1422 11
7899 11
1457 11
1962 11
7657 11
6733 11
2694 11
7751 11
4172 11
3554 11
5935 11
6753 11
3164 11
8528 11
3885 11
2166 11
2045 11
9240 11
3602 11
5145 11
6283 11
12528 11
4076 11
8012 11
5381 11
585 11
6785 11
4845 11
9502 10
5798 10
7419 10
3219 10
1229 10
4269 10
3110 10
8455 10
6333 10
3859 10
4563 10
2713 10
10559 10
4685 10
4695 10
5536 10
4345 10
10432 10
6043 10
4464 10
4853 10
3051 10
9942 10
10407 10
5669 10
7996 10
7089 10
7971 10
3407 10
4625 10
678 10
6466 10
1591 10
689 10
7998 10
3957 10
4386 10
7990 10
635 10
7923 9
6779 9
4203 9
1616 9
7507 9
7980 9
7828 9
11062 9
3963 9
908 9
8335 9
6446 9
634 9
7188 9
4267 9
4897 9
9330 9
11467 9
3684 9
10766 9
4020 9
7928 9
6958 9
9242 9
1960 9
5129 9
5339 9
3924 9
10031 9
6410 9
8486 9
2935 9
622 9
4806 9
4038 9
7154 9
1192 9
4738 9
4133 9
4406 9
632 9
2772 8
4494 8
624 8
7240 8
846 8
1847 8
1304 8
2997 8
872 8
2860 8
9462 8
9647 8
11275 8
9211 8
4371 8
719 8
12226 8
3174 8
3047 8
11786 8
3721 8
9169 8
576 8
7158 8
3397 8
8150 8
569 8
5607 8
2958 8
8619 8
700 8
12418 8
4681 8
8744 8
11378 8
5186 8
880 8
772 8
556 8
638 8
7626 8
799 8
4182 8
13316 8
4420 8
1343 8
4586 8
3439 8
5132 7
7218 7
993 7
9811 7
6121 7
7805 7
6406 7
5704 7
6387 7
6510 7
11055 7
2235 7
6108 7
3915 7
6540 7
7351 7
2985 7
6062 7
7258 7
5711 7
3307 7
6426 7
2227 7
6491 7
2276 7
10425 7
1419 7
6676 7
4025 7
3887 7
8022 7
853 7
5685 7
6969 7
8462 7
6898 7
803 7
12125 7
11870 7
7481 7
8691 7
1599 7
830 7
2682 7
7579 7
7467 7
763 7
11404 7
3849 7
641 7
8360 7
4065 7
2307 7
6875 7
6428 6
2742 6
10928 6
6370 6
3221 6
7220 6
11615 6
6627 6
10313 6
9824 6
3524 6
674 6
3001 6
1414 6
1546 6
1584 6
822 6
12530 6
9832 6
7732 6
7855 6
10045 6
9585 6
1571 6
7835 6
7785 6
10256 6
6907 6
3965 6
8897 6
8200 6
4367 6
4572 6
705 6
13154 6
8088 6
9987 6
7269 6
6135 6
3589 6
6064 6
5663 6
8728 6
3015 6
7712 6
626 6
2188 6
4893 6
2856 6
2500 6
7702 6
3148 6
8186 6
1868 6
9729 6
4930 6
7734 6
2124 6
11269 6
2274 6
8484 6
8163 6
6530 6
3078 6
736 6
4046 6
11549 5
6101 5
8063 5
8006 5
7523 5
11130 5
7554 5
6113 5
12740 5
2429 5
6846 5
2171 5
2366 5
6731 5
6287 5
1851 5
3019 5
3171 5
6372 5
8009 5
2899 5
8109 5
8057 5
5591 5
13292 5
6631 5
5649 5
7589 5
3280 5
1969 5
8662 5
8871 5
7333 5
6384 5
7110 5
4255 5
604 5
7252 5
13102 5
2312 5
2956 5
3686 5
13684 5
3692 5
6546 5
4138 5
10578 5
7939 5
8037 5
9764 5
12731 5
7968 5
6887 5
13654 5
8693 5
6420 5
6474 5
3199 5
819 5
10636 5
6131 5
7784 5
2425 5
2522 5
9011 5
7136 5
7035 5
6861 5
7878 5
8305 5
7700 5
8482 5
3285 5
3769 5
3787 5
868 5
6280 5
3658 5
12328 5
6438 5
7122 5
3783 5
12392 5
4098 5
8172 5
3476 5
6881 5
4135 5
4967 5
7880 5
4635 5
7475 5
2831 5
797 5
560 5
4589 5
3181 5
4301 5
6962 5
3773 5
